app/controllers/welcome_controller.rb

SELECT "users".* FROM "users"
---
  def landing
  	@users = User.all